import fetch from 'node-fetch'
let handler = async (m, { conn }) => {
  let caption = `❆❯━━━❲بوت سفروت🧸🤍❳━━━━━❮❆
  
*「 آية الكرسي 」*
اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ

❆❯━━━❲بوت سفروت🧸🤍❳━━━━━❮❆
`.trim()
  m.reply(caption)
}
handler.help = ['✓ ◡̈⃝ ✓│ايه-الكرسي📿◡̈⃝🤍']
handler.tags = ['islam']
handler.command = /^(ايه-الكرسي)$/i


export default handler
